W6D4/project_name/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 1]]
---
   def create
        artworkshare = ArtworkShare.new(artwork_share_params)
        if artworkshare.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]
---
   def destroy
        artworkshare = ArtworkShare.find(params[:id])
        artworkshare.destroy