W6D4/project_name/app/controllers/artworks_controller.rb

   def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "miumiu"], ["updated_at", "2020-10-08 20:06:05.282409"], ["id", 3]]