W6D4/project_name/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "michelleamazinglin@gmail.com"], ["updated_at", "2020-10-08 16:00:26.356938"], ["id", 2]]
---
   def update
        user = User.find(params[:id])
        if user.update(user_params)